Autodesk.Revit.DB.CurveLoop.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.CurveLoop.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.CurveLoop.NumberOfCurves
Returns the number of curves in the curve loop.
Returns:
The number of curves in the curve loop.
Since:
2019.1

Autodesk.Revit.DB.CurveLoop.GetCurveLoopIterator
Returns a curve that iterates through the curve loop.
Returns:
A curve loop iterator object that can be used to iterate through key-value pairs in the collection.
Since:
2013

Autodesk.Revit.DB.CurveLoop.CreateViaOffset(Autodesk.Revit.DB.CurveLoop,System.Collections.Generic.IList{System.Double},Autodesk.Revit.DB.XYZ)
Creates a new curve loop that is an offset of the existing curve loop.
Remarks:
For each curve i in the curve loop, the offset curve is theoretically defined by translating every point of the original curve by the
vector offsetDist[i] * (curveTan x normal) where curveTan is the curve's unit tangent vector at the given point. The curves are then
trimmed to create a continuous curve loop.  For a planar curve loop, this amounts to pushing each point "to the right" of the curve
loop by the signed offset distance offsetDist, within the plane of the curve loop. The "right" side of the curve loop at a given
point on the curve loop is defined with reference to normal being thought of as the upward direction and curveTan being thought of
as the forward direction, as if you are walking along the curve loop. It follows that if offsetDist[i] is positive, points will be
offset to the right of the curve loop, whereas if offsetDist[i] is negative, points will be offset to the left of the curve loop.
If the curve loop contains curves such as elliptical segments or splines, it is possible the offset creation will fail if
Revit will not be able to trim contiguous curves to meet one another.  If the offset is successful, offsets of those curve types
will be created as HermiteSplines.
original:
The original curve loop.
offsetDists:
The signed offset distances for each curve. The size of this array must match the size of the curve loop.
Curve at position i will be offset with offsetDists[i].
normal:
The normal of the offset plane.
Returns:
The offset curve loop.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the curve loop could not be offset.
Since:
2019.1

Autodesk.Revit.DB.CurveLoop.CreateViaOffset(Autodesk.Revit.DB.CurveLoop,System.Double,Autodesk.Revit.DB.XYZ)
Creates a new curve loop that is an offset of the existing curve loop.
Remarks:
For each curve in the curve loop, the offset curve is theoretically defined by translating every point of the original curve by the
vector offsetDist * (curveTan x normal) where curveTan is the curve's unit tangent vector at the given point. The curves are then
trimmed to create a continuous curve loop.  For a planar curve loop, this amounts to pushing each point "to the right" of the curve
loop by the signed offset distance offsetDist, within the plane of the curve loop. The "right" side of the curve loop at a given
point on the curve loop is defined with reference to normal being thought of as the upward direction and curveTan being thought of
as the forward direction, as if you are walking along the curve loop. It follows that if offsetDist is positive, points will be
offset to the right of the curve loop, whereas if offsetDist is negative, points will be offset to the left of the curve loop.
If the curve loop contains curves such as elliptical segments or splines, it is possible the offset creation will fail if
Revit will not be able to trim contiguous curves to meet one another.  If the offset is successful, offsets of those curve types
will be created as HermiteSplines.
original:
The original curve loop.
offsetDist:
The signed offset distance.
normal:
The normal of the offset plane.
Returns:
The offset curve loop.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the curve loop could not be offset.
Since:
2015

Autodesk.Revit.DB.CurveLoop.CreateViaCopy(Autodesk.Revit.DB.CurveLoop)
Creates a new curve loop as a copy of the input.
original:
The original curve loop.
Returns:
The copied curve loop.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.CurveLoop.Flip
Reverses the orientation of the curve loop.
Since:
2012

Autodesk.Revit.DB.CurveLoop.IsCounterclockwise(Autodesk.Revit.DB.XYZ)
Determines if this CurveLoop is oriented counter-clockwise (CCW) or clockwise (CW) with
respect to the specified 3D direction.
Remarks:
CCW means that the projection of the CurveLoop onto a plane having "normal" as its oriented normal is CCW.
This method should only be called if the loop is closed and has a non-singular projection onto the plane
(i.e., the projection should have no self-intersections and should not be degenerate or even
nearly degenerate). The return value in other cases is indeterminate.
normal:
The normal vector to the plane used for this determination.
Returns:
True if the curve loop is oriented counter-clockwise with respect to the specified 3D direction,
false if the loop is oriented clockwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The curve loop is open or consists of a single unbound curve; counterclockwise determination has no meaning.
Since:
2012

Autodesk.Revit.DB.CurveLoop.IsOpen
Returns whether the curve loop is open or closed, as determined by an internal flag.
Remarks:
Some routines in Revit may set the CurveLoop to be marked "open" or "closed" in spite of the actual geometry of the curves.
In these special cases, the CurveLoop class does not require that the CurveLoop is correctly marked.
Returns:
True if the CurveLoop is marked open, false if marked closed.
Since:
2012

Autodesk.Revit.DB.CurveLoop.Transform(Autodesk.Revit.DB.Transform)
Transforms this curve loop and all of its component curves by the supplied transformation.
Remarks:
The modified CurveLoop is guaranteed to be valid with all consituent curves contiguous (assuming
that the curves were contiguous in the input curve loop).
transform:
The transformation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
transform is not conformal.
-or-
transform has a scale that is negative or zero.
Since:
2016

Autodesk.Revit.DB.CurveLoop.CreateViaTransform(Autodesk.Revit.DB.CurveLoop,Autodesk.Revit.DB.Transform)
Creates a new curve loop as a transformed copy of the input curve loop.
Remarks:
The newly created CurveLoop is guaranteed to be valid with all consituent curves contiguous (assuming
that the curves were contiguous in the input curve loop).
curveLoop:
The input curve loop.
transform:
The transformation.
Returns:
The new curve loop.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
transform is not conformal.
-or-
transform has a scale that is negative or zero.
Since:
2016

Autodesk.Revit.DB.CurveLoop.CreateViaThicken(Autodesk.Revit.DB.CurveLoop,System.Double,Autodesk.Revit.DB.XYZ)
Creates a new closed curve loop by thickening the input open curve loop with respect to a given plane.
Remarks:
The new loop will be created via
offsets of the input curve loop (in the plane of the normal vector) with the endpoints
connected with lines.The original curve loop will be at the center of the new loop.
If the curve loop contains curves such as elliptical segments or splines, it is possible the offset creation will fail if
Revit will not be able to trim contiguous curves to meet one another.  If the offset is successful, offsets of those curve types
will be created as HermiteSplines.
curveLoop:
The input curve loop.
thickness:
The distance between the offset curves created on either side of the input curve.
normal:
The normal vector to the plane used for thickening.
Returns:
The new curve loop.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input thickness is too short for a curve.
-or-
the curve loop is not marked as open.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Throws if the input curve could not be thickened.
Since:
2015

Autodesk.Revit.DB.CurveLoop.CreateViaThicken(Autodesk.Revit.DB.Curve,System.Double,Autodesk.Revit.DB.XYZ)
Creates a new closed curve loop by thickening the input curve with respect to a given plane.
Remarks:
The new loop will be created via
offsets of the input curve (in the plane of the normal vector) with the endpoints
connected with lines.The original curve will be at the center of the new loop.
Note that for input elliptical fragments and NurbSpline curves, any offsets will be created as HermiteSplines.
pCurve:
The input curve.
thickness:
The distance between the offset curves created on either side of the input curve.
normal:
The normal vector to the plane used for thickening.
Returns:
The new curve loop.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input thickness is too short for a curve.
-or-
The input pCurve points to a helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Throws if the input curve could not be thickened.
Since:
2012

Autodesk.Revit.DB.CurveLoop.GetRectangularHeight(Autodesk.Revit.DB.Plane)
Returns the width of a curve loop if it is rectangular with respect to the projection plane.
Remarks:
The height is determined by the V extents of the UV curve created by from the curve loop plane.
plane:
The plane to which the curves will be projected.
Returns:
The height.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The curve loop is not rectangular when projected to the input plane.
Since:
2012

Autodesk.Revit.DB.CurveLoop.GetRectangularWidth(Autodesk.Revit.DB.Plane)
Returns the width of a curve loop if it is rectangular with respect to the projection plane.
Remarks:
The width is determined by the U extents of the UV curve created by from the curve loop plane.
plane:
The plane to which the curves will be projected.
Returns:
The width.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The curve loop is not rectangular when projected to the input plane.
Since:
2012

Autodesk.Revit.DB.CurveLoop.IsRectangular(Autodesk.Revit.DB.Plane)
Identifies if the curve loop is rectangular with respect to a given projection plane.
plane:
The plane to which the curves will be projected to determine if they represent a rectangle.
Returns:
True if the curve loop is rectangular, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.CurveLoop.GetExactLength
Returns the sum of exact lengths of all curves in the loop.
Returns:
The total length of the curves in the loop.
Since:
2012

Autodesk.Revit.DB.CurveLoop.HasPlane
Identifies if the CurveLoop is planar.
Returns:
True if the curve loop is planar, false otherwise.
Since:
2013

Autodesk.Revit.DB.CurveLoop.GetPlane
Gets the plane of the curve loop, if it is planar.
Returns:
The plane of the curve loop.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The curve loop does not lie in a single plane.
Since:
2012

Autodesk.Revit.DB.CurveLoop.Append(Autodesk.Revit.DB.Curve)
Append the curve to this loop.
curve:
The curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve points to a helical curve and is not supported for this operation.
-or-
Throws if the input curve makes the loop not contiguous.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.CurveLoop.Create(System.Collections.Generic.IList{Autodesk.Revit.DB.Curve})
Creates a new curve loop.
curves:
The curves.
Returns:
The curve loop.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curves contains at least one helical curve and is not supported for this operation.
-or-
Throws if the input curves are not contiguous.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.CurveLoop.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.CurveLoop.#ctor
Constructs a new empty curve loop.
Since:
2012

Autodesk.Revit.DB.CurveLoop
A class that represents a chain of curves.
Remarks:
There are a specific set of requirements for how valid CurveLoops must be formed:
The curves must typically be continuous.It may be either closed (where the start and end points coincide) or open.There should be no self-intersections.
A CurveLoop is said to be "continuous" if either:
the loop contains at most one curvethe end of each curve coincides with the start of the next one (if there is a next curve).
Many geometry utilities require CurveLoops to be continuous, but discontinuous CurveLoops are sometimes used. For example, the curves
in a continuous CurveLoop may be offset, resulting in a discontinuous loop if the offset curves overlap or do not meet, and the offset
curves might then be extended or trimmed to form a continuous CurveLoop.
A CurveLoop is said to be "closed" if it is non-empty, continuous, and if either:
the loop contains just one curve, which is unbounded and periodicthe loop's end point coincides with its start point
For example, a CurveLoop comprising four lines forming a rectangle, listed in order around the rectangle, with each curve oriented in direction
in which the curves are listed is closed. As another example, a CurveLoop consisting of just one unbounded circle is closed.
A CurveLoop is said to be "open" if it is not closed. For example, a CurveLoop consisting of a single line is open, as is the "offset CurveLoop"
mentioned above. Note that an open CurveLoop may be continuous or discontinuous, and a continuous CurveLoop may be open or closed. The definitions
imply that a discontinuous CurveLoop is necessarily open and an empty CurveLoop is open.
It should also be noted that these definitions take the order of the curves and the curves' directions into account. For example, a CurveLoop
comprising the four edges of a rectangle in the order {bottom, top, left, right} is discontinuous. Similarly, a CurveLoop comprising the four
edges of a rectangle in the order {bottom, right, top, left}, with three of the lines oriented in the counter-clockwise direction of
the rectangle and the fourth oriented in the clockwise direction, is discontinuous.
Finally, note that some routines in Revit may set the CurveLoop to be marked "open" or "closed" in spite of the actual geometry of the curves.
In these special cases, the CurveLoop class does not require that the CurveLoop is correctly marked.
In the API, the members of the CurveLoop may be directly iterated, as the class implements IEnumerable<Curve>.  The iteration
provides copies of the curves directly contained in the loop; modification of the curves will not affect the curves that are contained in the loop.
Since:
2012